s= 'Определите, сколько раз в тексте встречается заданное слово (взять произвольный текст и проверить решение для 2-3 разных слов) cлов'

count = s.count('слов')
print(count)